Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-11-06 02:10:04--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.163.117
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.163.117|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  93.7MB/s    in 2.1s

2019-11-06 02:10:06 (93.7 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
#I think this is all we'll need for tonight
import pandas as pd
import numpy as np
import seaborn as sns

In [14]:
#okay I don't have much documentation on these data sets. So lets just read them in and check them out
orders = pd.read_csv('orders.csv')
print(orders.shape)
orders.head()

(3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [15]:
#Okay, order id is probably useful from this. Not sure yet.
order_products__prior = pd.read_csv('order_products__prior.csv')
print(order_products__prior.shape)
order_products__prior.head()

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [16]:
#alright, looks like this definitely has several product IDs associated with a particular order#.  So this is effectively what is in
#each order.  Lets look at those products.
products = pd.read_csv('products.csv')
print(products.shape)
products.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [18]:
#okay I'm sure these are the only dataframes I need.  But at this stage, I feel I should read in the rest just to be careful
aisles = pd.read_csv('aisles.csv')
print(aisles.shape)
aisles.head()

(134, 2)

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [19]:
departments = pd.read_csv('departments.csv')
print(departments.shape)
departments.head()

(21, 2)

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [20]:
#good thing I read them in, this is probably useful too.
order_products__train = pd.read_csv('order_products__train.csv')
print(order_products__train.shape)
order_products__train.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [0]:
#okay so I need products, __prior and __train to get what I need.  So lets plan this out a bit.
#first is full merge of of __prior & __train data sets. We want all that info.
#Second explore the reordered column.  Is that a binary switch (0 false, 1 true), or does it seem like a quantity?
#then I think I want to make a dataframe with our top 10 products, and I think merge that on product_id, merge typ to be figured out
#in theory this will make a data frame with only the top 10 products from our __prior & __train data sets
#then I can maybe do some valuecounts and boom. I think thats what we need.

In [21]:
#actually lets explore reorder first
#looks like it is a boolean.  Not useful for our purposes
order_products__prior['reordered'].value_counts()

1    19126536
0    13307953
Name: reordered, dtype: int64

In [23]:
#okay so I know I want the product_id from the order_products data sets.  I'm keeping the order number so we can have unique
#entries with our merge
order_products__full = pd.merge(order_products__prior[['order_id', 'product_id']], 
                                order_products__train[['order_id', 'product_id']], how = 'outer')
print(order_products__full.shape)
order_products__full.head()

(33819106, 2)

   order_id  product_id
0         2       33120
1         2       28985
2         2        9327
3         2       45918
4         2       30035

In [24]:
#the above shape is jiving with the shape of our two individual dataframes. But I realize, I didn't check them for duplicates.
#maybe I can use an inner merge to do that. Okay definitely no dupes.  Good to go.  Checked in class, teach recommends df.duplicated()
#noted for future
dupes = pd.merge(order_products__prior[['order_id', 'product_id']], 
                                order_products__train[['order_id', 'product_id']], how = 'inner')
print(dupes.shape)
dupes.head()

(0, 2)

Empty DataFrame
Columns: [order_id, product_id]
Index: []

In [32]:
#testing duplicated
order_products__full.duplicated().value_counts()

False    33819106
dtype: int64

In [30]:
#okay lets make our index data frame for our merge

index = pd.DataFrame({'product_name': ['Banana', 'Bag of Organic Bananas', 'Organic Strawberries', 
                                       'Organic Baby Spinach', 'Organic Hass Avocado', 'Organic Avocado', 'Large Lemon',
                                       'Strawberries', 'Limes', 'Organic Whole Milk']})
print(index.shape)
index.head()

(10, 1)

             product_name
0                  Banana
1  Bag of Organic Bananas
2    Organic Strawberries
3    Organic Baby Spinach
4    Organic Hass Avocado

In [33]:
#okay so lets use a left merge to get the product_ids from the products dataframe.
index = pd.merge(index, products[['product_name', 'product_id']], on = 'product_name', how = 'left')

print(index.shape)
index.head()

(10, 2)

             product_name  product_id
0                  Banana       24852
1  Bag of Organic Bananas       13176
2    Organic Strawberries       21137
3    Organic Baby Spinach       21903
4    Organic Hass Avocado       47209

In [35]:
#okay lets use another merge to get a dataframe of only our top ten products, and their order numbers. Order number should result
#in a unique entry for each item.
topten = pd.merge(index, order_products__full, on = 'product_id', how = 'left')
print(topten.shape)
topten.head()

(2418314, 3)

  product_name  product_id  order_id
0       Banana       24852        10
1       Banana       24852        20
2       Banana       24852        22
3       Banana       24852        26
4       Banana       24852        52

In [46]:
#Alright lets count them up
topten['product_name'].value_counts()

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
flights = sns.load_dataset('flights')

In [0]:
#imports we missed above
import matplotlib.pyplot as plt
%matplotlib inline

In [48]:
#create df1
df1 = pd.DataFrame([['a', 1], ['b', 2]], columns = ['letter', 'number'])
df1.head()

  letter  number
0      a       1
1      b       2

In [49]:
#creating df2
df2 = pd.DataFrame([['c', 3], ['d', 4]], columns = ['letter', 'number'])
df2.head()

  letter  number
0      c       3
1      d       4

In [50]:
#Next, lets stick the dataframes on top of each other using concat, 
#'axis=0' indicates a row operation. Note that 'axis=0' is the default and doesn't have to be set
df3 = pd.concat([df1, df2], axis=0)
df3

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [51]:
#Lets stick the datframes next to each other using 'concat'.
#here, 'axis=1' indicates a column operation.
df4 = pd.concat([df1, df2], axis=1)
df4.columns = ['a', 'b', 'c', 'd']
df4

   a  b  c  d
0  a  1  c  3
1  b  2  d  4

In [53]:
#Merge
#Stock names
stockname = pd.DataFrame({'Symbol': ['AMZN', 'MSFT', 'FB', 'AAPL', 'GOOGL'], 
                         'Name': ['Amazon', 'Microsoft', 'Facebook', 'Apple', 'Google']})
stockname

  Symbol       Name
0   AMZN     Amazon
1   MSFT  Microsoft
2     FB   Facebook
3   AAPL      Apple
4  GOOGL     Google

In [54]:
#stock prices
openprice = pd.DataFrame({'Symbol': ['AAPL', 'MSFT', 'GOOGL', 'FB', 'AMZN'],
                         'OpenPrice': [217.51, 96.54, 501.3, 51.45, 1703.34]})
openprice

  Symbol  OpenPrice
0   AAPL     217.51
1   MSFT      96.54
2  GOOGL     501.30
3     FB      51.45
4   AMZN    1703.34

In [55]:
#Merge the dataframes
named_stocks = pd.merge(openprice, stockname, on = 'Symbol')
named_stocks

  Symbol  OpenPrice       Name
0   AAPL     217.51      Apple
1   MSFT      96.54  Microsoft
2  GOOGL     501.30     Google
3     FB      51.45   Facebook
4   AMZN    1703.34     Amazon

In [56]:
#creating a 3rd dataset of weekly highs
wkhigh = pd.DataFrame({'Symbol': ['FB', 'AMZN', 'AAPL', 'MSFT', 'NFLX'], 
                      '52wkHigh': [60.79, 2050.49, 233.47, 110.11, 303.22]})
wkhigh

  Symbol  52wkHigh
0     FB     60.79
1   AMZN   2050.49
2   AAPL    233.47
3   MSFT    110.11
4   NFLX    303.22

In [57]:
#now merge that with the named stocks
#inner merge, only merges the entries that each dataframe has from the symbol column
full_stocks = pd.merge(named_stocks, wkhigh, on = 'Symbol', how = 'inner')
full_stocks

  Symbol  OpenPrice       Name  52wkHigh
0   AAPL     217.51      Apple    233.47
1   MSFT      96.54  Microsoft    110.11
2     FB      51.45   Facebook     60.79
3   AMZN    1703.34     Amazon   2050.49

In [59]:
#left, only merges the entries present from the left dataframe(named_stocks) from the symbol column
full_stocks = pd.merge(named_stocks, wkhigh, on = 'Symbol', how = 'left')
full_stocks

  Symbol  OpenPrice       Name  52wkHigh
0   AAPL     217.51      Apple    233.47
1   MSFT      96.54  Microsoft    110.11
2  GOOGL     501.30     Google       NaN
3     FB      51.45   Facebook     60.79
4   AMZN    1703.34     Amazon   2050.49

In [60]:
#right, only merges the entries present from the right dataframe(wkhigh) from the symbol column
full_stocks = pd.merge(named_stocks, wkhigh, on = 'Symbol', how = 'right')
full_stocks

  Symbol  OpenPrice       Name  52wkHigh
0   AAPL     217.51      Apple    233.47
1   MSFT      96.54  Microsoft    110.11
2     FB      51.45   Facebook     60.79
3   AMZN    1703.34     Amazon   2050.49
4   NFLX        NaN        NaN    303.22

In [62]:
#outer, merges all entries from both dataframes from the symbol column
full_stocks = pd.merge(named_stocks, wkhigh, on = 'Symbol', how = 'outer')
full_stocks

  Symbol  OpenPrice       Name  52wkHigh
0   AAPL     217.51      Apple    233.47
1   MSFT      96.54  Microsoft    110.11
2  GOOGL     501.30     Google       NaN
3     FB      51.45   Facebook     60.79
4   AMZN    1703.34     Amazon   2050.49
5   NFLX        NaN        NaN    303.22

In [63]:
# This is code to display a `.png` inside of a jupyter notebook.
from IPython.display import display, Image
url = 'https://shanelynnwebsite-mid9n9g1q9y8tt.netdna-ssl.com/wp-content/uploads/2017/03/join-types-merge-names.jpg'
venn_diagram = Image(url=url, width=600)
display(venn_diagram)

In [64]:
full_stocks.shape

(6, 4)

In [0]:
#Lets creat a simple table
myindex = ['John Smith', 'Jane Doe', 'Mary Johnson']
mycolumns = ['treatmenta', 'treatmentb']

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16, 11],
     [3,1]],
     columns = mycolumns, index = myindex)

In [77]:
#This is an example of 'Wide format'
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [78]:
#This is how you can transpose a dataframe
table2 = table1.T
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [79]:
#Table1 -> Tidy
#the pandas melt function can be used to reformat into Tidy format
#first step is to get the columns in list form
list(table1.columns)
table1.columns.tolist()

['treatmenta', 'treatmentb']

In [80]:
#now get the index values as another list
table1.index.tolist()

['John Smith', 'Jane Doe', 'Mary Johnson']

In [81]:
#this is here to demonstrate what the datframe looks like before reset_index
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [91]:
#For table 1, convert the index into a column using the 'reset_index' method.
#note the index is not normally a column in a dataframe.
table1 = table1.reset_index()
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [92]:
#conver the table from 'wide' to 'tidy' format using the 'melt' method.
tidy = table1.melt(id_vars = 'index', value_vars = ['treatmenta', 'treatmentb'])
tidy

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [93]:
#rename the columns
tidy = tidy.rename(columns = {'index': 'name', 'variable': 'trt', 'value': 'result'})
tidy

           name         trt  result
0    John Smith  treatmenta     NaN
1      Jane Doe  treatmenta    16.0
2  Mary Johnson  treatmenta     3.0
3    John Smith  treatmentb     2.0
4      Jane Doe  treatmentb    11.0
5  Mary Johnson  treatmentb     1.0

In [94]:
#shorten the 'trt' values
tidy['trt'] = tidy['trt'].str.replace('treatment', '')
tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [95]:
#Table 2 -> Tidy
########## Assignment exercise
#lets just look at table 2 for a refersher
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [96]:
#okay so lets reset that index to a column
table2 = table2.reset_index()
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [97]:
tidy2 = table2.melt(id_vars = 'index', value_vars = ['treatmenta', 'treatmentb'])

KeyError: ignored

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####